 <<向量>>
    叉积:
        对于二维两个向量叉积的几何解析:
            现有两个向量A和B,对于它们的叉积:
                |xA xB|
                |yA yB| = (xA*yB - yA*xB)
            完全展开行列式的全部解析过程:
                A x B = |A| * |B| * sinµ
                A x B = |A| * |B| * sqrt(1 - (cosµ)^2)
                A x B = |A| * |B| * sqrt(1 - (((A · B)*(|A| * |B|))^2))
                A x B = sqrt(|A|^2 * |B|^2 * (1 - (((A · B)*(|A| * |B|))^2)))
                A x B = sqrt(|A|^2 * |B|^2  - (|A|^2 * |B|^2 ) * (((A · B)*(|A| * |B|))^2))
                A x B = sqrt(|A|^2 * |B|^2  - ((A · B)))
                A x B = sqrt((xA^2 + yA^2) * (xB^2 + yB^2)  - ((xAxB + yAyB)))
                根号内化简最后得:
                A x B = xAyB - yAxB

    向量(矢量),包含长度和方向.
    当一个向量的长度为0,则该向量没有方向性,该向量称为0向量
    向量的0次幂,表示为单位向量:
        a/|a| = a^0;
        又作:
            a * |a|^-1 = a^0;
    确定平面的条件:
        1.两条相交直线(在二维笛卡尔坐标系下表示,两条斜率不同的直线,即y1=k1*x1+b1和y2=k2*x2+b2的k1不等于k2);
        2.两条不共线的向量: v != λa.
        3.两条平行直线
            在笛卡尔坐标系下表示为: y1=k1+x1+b1 和 y2=k2+x2+b2两条直线的k1=k2 但是b1!=b2;
            通过向量表示为: 两个向量共线,即a·b = 1 或 a·b = -1; a=λb 或 b=λa;


    ->#共线性与共面性:
        两个向量间的共线性:
            共线:
                0向量与任何向量都共线,且共面.
                任意两个共线的向量间一定共面,而两个向量即使不共线,他们依旧共面.
                当一个向量b = γa,则;a与b一定共线,反之依然,当两个向量共线,那他们一定满足b = γb.
                同向:
                    如果同向则代表两个向量的单位向量一定相同.
                    因此:
                        b = |b| * b^0
                        = |b| * a^0
                        = (|b| * |a|^-1) * a
                        = γ * a
                不同向:
                    如果b^0 = -(a^0);或者b = -γ(a),γ ∈ N+;
                    则说明两个向量不共线.
            不共线:
                当b^0 != -(a^0);或者b != -γ(a),γ ∈ N+;时代表两个向量的方向不统一,他们不共线.

            向量直线方程:
                直线的向量参数方程:
                    对于经过一个点O并与向量v方向相同的一条直线可以用OM = tv表示,
                        展开OM = tv得:
                            (M-O) = tv
                                M = tv + O
                        M = tv + O 就是直线的向量参数方程.
                        |x = tX + x0,
                        |y = tY + y0,
                        |z = tZ + z0;   (X = vx , Y = vy , Z = vz)
                    通过共线醒可知,两向量的分量都成比例为t
                直线方程:
                    由向量参数方程得:
                        t = (x-x0)/X,
                        t = (y-y0)/Y,
                        t = (z-z0)/Z,
                    因此:
                        (x-x0)/X = (y-y0)/Y = (z-z0)/Z.

                        由直线方程可得,直线的两点式方程:
                            (x-x0)/(x1-x2) = (y-y0)/(y1-y2) = (z-z0)/(z1-z2).

                直线普通方程:
                    又因为人一直线都可以是相交平面的交线,因此通过平面普通方程可得:
                        |A1x + B1y + C1z + D1 = 0,
                        |A2x + B2y + C2z + D2 = 0;

                直线的标准方程:
                    获取平行于两个平面交线的平行向量
                        因为Ax + By + Cz + D = 0 中的A B C实际是一个平面的法向量
                        因此两个平面的法向量进行叉乘可以获得平行于两个平面的向量,
                        而对于相交平面,则这个向量平行于交线:
                            交线l的平行向量:
                                                                   |B1 C1|    |A1 C1| , |A1 B1|
                                (A1 , B1 , C1) x (A2 , B2 , C2) = (|B2 C2| , -|A2 C2| , |A2 B2|);


        三点共面性:
            当µa + µb = c时,a b c三个向量共面.
            或者说c = µa + µb,则a b c三个向量共面.
            此外,向量的共面不是代表向量间构成面,而是在一个面里,因此共线的向量都共面.
        总结:
            如果有一点M在一个向量AB中间为AB的中点,取任何形成非共线或共线一点O做OM向量,则都有OM = (OA + OB) * (1 / 2);
            证明:
                AM = AO + OM
                BM = BO + OM
                ∵ M是中点
                ∴ AM = MB
                ∵ BM = -MB
                ∴ AM + BM = 0
                ∴ 联立两个线性方程得
                AM + BM = AO + BO + 2OM
                0 = AO + BO + 2OM
                2OM = -(AO + BO)
                ∵ AO = -OA ; BO = -OB
                ∴ 2OM = OA + OB
                OM = (OA + OB) * (1 / 2)

        三条向量共面:
            当向量OM = λOA + μOB;可知OM与OA和OB共面;
            设O为(x0,y0,z0),A(x1,y1,z1),B(x2,y2,z2);
            则有OM向量为:
                M=|x = x0 + λx1 + μx2|
                |y = y0 + λy1 + μy2|
                |z = z0 + λz1 + μz2|
            因此三个向量为:
                | I  I  I |   |x-x0  x1  x2| 
                |OM OA OB | = |y-y0  y1  y2| 
                | I  I  I |   |z-z0  z1  z2|

            三向量共面的充分必要条件是:
                混合积为零
                OM · (OA x OB) = 0;
                
                            |y1 y2|    |x1 x2|   |x1 x2|
                OA x OB = ( |z1 z2| , -|z1 z2| , |y1 y2|);

                        |y1 y2|       |x1 x2|      |x1 x2|
                try A = |z1 z2|, B = -|z1 z2|, C = |y1 y2|
                ∴ OM · (OA x OB) = (x-x0) * y"(OA x OB)" + (y-y0) * y"(OA x OB)" + (z-z0) * z"(OA x OB)";
                将(OA x OB)的新向量的个分量分布为A,B,C
                ∴ OM · (OA x OB) = (x-x0) * A + (y-y0) * B + (z-z0) * C;
                化简得到线性方程:
                    (Ax + By + Cz) - (Ax0 + By0 + Cz0) = (Ax + By +Cz) + D = 0 
                    其中D = - (Ax0 + By0 + Cz0);
                因此可以得到平面可以由三元一次方程得到,且任意三元一次方程都能得到一个平面.

                为什么混合积为0可以确定三个向量共面?
                    首先混合积本身可以证明一个正六面体的体积,当体积为0时,会坍缩为一个平面,则三个向量必在一个面上.
                    对混合积的展开:
                        (a x b) · c
                        =|a x b| * (Π_(a x b)^0 · c)
                        =|a x b| * (((a x b)/|a x b|) · c)
                    |a x b|为正六边形的底面积
                    Π_(a x b)^0计算底面积对应的垂直单位基向量
                    (((a x b)/|a x b|) · c)为展开式,得到一个正六边形的高的式子.
            因此对于三个向量是否共面的集合解析:
                向量A 作为高 乘以 向量B和向量C叉积所构成的平面,得到最后的体积为0,则说明高为0,因此向量A在这个平面上的时候,才能表示高为0
            此外共面的另一个特质是,共面也相当于向量A与平面平行
            对于向量A·(向量Bx向量C)的理解:
                想象,A要跟一个垂直于向量B和C的向量去点乘,根据点乘的几何意义,如果垂直则两个点乘为1,反之为0.当为0时则代表相当于两个向量中不产生夹角,所以平行.
    ->#投影:
        首先内外射影的轴为直角坐标系.
        内射影:
            向量沿着某个轴e的方向,对这个轴的投影.
        外射影:
            向量α对于某个平面的投影,且投影向量垂直于某个轴e.
            在二维中x是y的外投影,在三维中,选定某个轴e,这为主轴.
            取向量α在相对于e的另一个e1轴下的投影和向量α相当于与e的另一个轴e2的投影结合的新向量α2.
            这个α2就是对于e轴的外投影.因此α2垂直于e.
        
        P_e(α)表示向量α在e方向上的内投影.
        Π_e(α)表示向量α在e方向的分量,使得α = μe.
    
    ->#方向角:
        向量与基向量所成的夹角为方向角.
        如向量a和轴e1,e2,e3所成的夹角,α,λ,γ三个角
        方向角的余弦,而α,λ,γ三个角对应的cos值为方向余弦.
    
    ->#混合积:
        混合积是“叉乘后点乘” 的实数结果.
        (a x b) · c
        =|a x b| * (Π_(a x b)^0(c))
        =|a x b| * (((a x b)/|a x b|) · c)
        = (a x b) · c      //化简后得到
    
    ->#判断两个面间的关系:
        一般的来说有三种关系:1相交 2平行 3 重合.
        取定两个平面:
            Plane1 : A1x + B1y + C1z + D1 =0;
            Plane2 : A2x + B2y + C2z + D2 =0;
            回顾平面展开式:(x(y1z2 - y2z1) - y(x1z2 - x2z1) + z(x1y2 - x2y1);) 
                        或
                        :(x(y1z2 - y2z1) + y(x2z1 - x1z2) + z(x1y2 - x2y1);)
        1.重合:当两个平面的各系数成比例,则代表两个平面平行,且常数项也成比例(n1 = kn2)
            A1 = kA2,  B1 = kB2,  C1 = kC2, D1 = kD2;
        2.平行:当两个平面的各系数成比例,但常数项不成比例的时候,两平面属于平行状态.
            A1 = kA2,  B1 = kB2,  C1 = kC2;
            D1 != kD2;
        3.相交:当两个平面的个系数有其中一个不成比例,则两平面相交(常数项可成也可不成).

    ->#法向量:
        作为垂直于一个平面的向量,法向量的获得根据形成平面的向量叉乘而来;
        即:首先一个平面的形成是通过两个向量通过张成形成的空间,因此这两个向量叉乘,会获得垂直于这两个平面的向量,而这个向量就是垂直于平面的法向量.
        其次,法向量是向量,是一个方向,因此整个平面的所有垂直于该平面的向量都是同一个方向,即:法向量


    ->#平面:
        ->#一个点和一个法向量确定平面:
            虽然是一个点,实际是根据一个点以及它在平面上取的另一个点所形成的向量与法向量点乘.
            由平面公式Ax + By + Cz + D = 0可知,当一个点或者向量在面上时(重合),各系数和常数项成比例.
            其中个系数A , B , C是平面向量通过叉乘获得的垂直于平面的向量,即法向量.
            因此A = Normal_x = Nx , B = Normal_y = Ny , C = Normal_z = Nz.
            因为D与平面上的点有关 D = -(Nx*px0 , Ny*py0 , Nz*pz0).

            例题:
                有一平面,过点A(1,-2,0),并且它的法线是n(3,1,-2),则平面普通方程为:
                    ∵平面过点A,所以可以知道平面的起始在过A的一条直线上,所以该向量(x-x0 , y-y0 , z-z0)的表达式为(x-1 , y+2 , z)
                    ∴通过平面普通方程可知:
                        3x+y-2z - (3x0 + y0 - 2z0) = 0,可以知道,当x,y,z为A(1,-2,0)的时候,才会等于0
                        所以可知:
                            3x+y-2z-1=0,为该平面普通方程
                    
                

        ->#平面的确定方程:
            两向量过一点但不共线,就可以确定一个平面.
            两个向量共线其实也可以表示一个平面(因为向量是方向,当他们的起点不同:
                比如v(1,0,0)有两个起点,起点O1为(1,1,0),而起点O2为(1,-1,0),O1v 和 O2v是两个平行向量)
                
        ->#平面方程:
            当有两个不共线向量OA和OB本身可以通过正六面体体积为0时组成一个平面.因此可以通过向量OM(x-x0,y-y0,z-z0)共面共面确定一个平面.   
                ->#平面的参数方程:
                    OM = λOA + μOB:
                        |x = x0 + λOAx + μOBx;
                        |y = y0 + λOAy + μOBy;
                        |z = z0 + λOAz + μOBz;
                ->#平面普通方程:
                    OM · (OA x OB) = 0 其中OM(x-x0 , y-y0 , z-z0),M是点(x,y,z)---这是模型空间下的点坐标.
                    展开:
                        (Ax + By + Cz) - (Ax0 + By0 + Cz0) = 0;
                        Ax + By + Cz + D = 0 其中D = -(Ax0 + By0 + Cz0)
                    因此当一个向量和法向量点乘为0时是在平面上的,或者也可以考虑是距离平面为0的点.
                普通平面方程>0的时候:
                    该向量不在平面上,而脱离平面但与法向量方向`一致`.
                普通平面方程<0的时候:
                    该向量不在平面上,而脱离平面但与法向量方向`相反`.

                ->#对于平面的普通方程理解:
                    Ax+By+Cz+D=0 作为一个普通平面方程不仅是平面两向量叉乘得到的法线跟某一向量相乘,而得到的正几何体体积公式.
                    此外对于普通公式的理解:
                        假如现在有一平面的法向量为(1,0,0)即x轴,即根据普通平面方程可知:x+D=0.
                        假设因为D=-Ax0,所以x0=3,则有平面x=3,并解释为,x等于3,的所有y和z的点的集合组成的平面,垂直于x轴,并且面经过(3,9,9).

                    ->#平面空间变换:
                        根据空间变换原则,我认为平面方程也存在空间变换,对于OM(x-x0 , y-y0 , z-z0)其实是将世界孔家按转换到了模型空间,因此组成的平面并不是世界空间下,而是模型空间下的向量坐标.
                        换句话说OM(x-x0 , y-y0 , z-z0)的点M(x-x0 , y-y0 , z-z0)是在模型空间下的点集合,是减去偏移的归一化空间下的坐标.
                            比如由O(-1,2,0), A(-2,-1,4), B(3,1,-5)三点可以组成平面:
                                设O为原点,连接OA,OB,由两个不共线向量可以组成平面定理可知,λOA和μOB可以组成平面.
                                    首先获得模型空间下的平面参数方程:
                                        |OMx = λ(-1) + μ(4);
                                        |OMy = λ(-2) + μ(-1);
                                        |OMz = λ(3)  + μ(5);
                                    因为是模型空间下的所以OM的原点是(0,0,0)点,因此需要回到世界空间下以O点为原点的平面坐标.
                                    因此,世界空间下的向量坐标为:
                                        OM + O.
                        
        对于参数方程和普通平面方程的总结:
            此外,普通方程是用来证明点是否在平面上,而参数方程可以计算出平面上的具体的点的坐标.

    ->#点到平面的距离:
        是通过点的垂直于平面的向量,用法向量来计算距离值的.
            Point : M(x , y , z) ; O(x0 , y0 , z0)
            Vector OM : (x-x0 , y - y0 , z - z0)
            Plane Pl : Ax + By + Cz - (Ax0 + By0 + Cz0) = 0
            Normal n: (A , B , C)

        通过垂直于平面的向量跟法向量共线可知:
            OM = µn^0;
            通过两边点乘n^0得到(因为单位向量点乘为1所以消除右侧法向量n^0)
            OM · n^0 = µ
            µ就是长度
            展开得:
                µ = {(x - x0),(y - y0) , (z - z0)} · ({A,B,C} / sqrt(A^2 + B^2 + C^2))
                  = [{(x-x0), (y-y0), (z-z0)} · {A,B,C}] * (1/sqrt(A^2 + B^2 + C^2))
                  = [(Ax + By + Cz) + D] / sqrt(A^2 + B^2 + C^2)
        Distance d = |µ|.


            例题:
                点到面的距离:
                    点A(0,2,1)到平面2x-3y+5z+1=0的距离:
                        根据信息已知法向量为n(2,-3,5).

                        首先设平面上y和z为0,则求出平面于x轴上的交点:
                            ∵2x+1=0;x=1/2;
                            ∴Px(1/2,0,0)

                        之后求一Px为原点的PxM和以Px为原点Pxn的法向量的点积即可:
                            为方便求值,M减去Px可以,以原点为中心,而不是以Px为中心:
                                OM=M-Px
                                =(-1/2,2,1)

                                求点积OM·n得距离为:
                                    sqrt(38)/19.



        ->#两个平面的夹角:
            由两个平面的法向量确定:
                通过向量点乘可知:
                    n1 · n2 = |n1| * |n2| * cosθ
                    cosθ = (n1 · n2)/(|n1|*|n2|)
                因此当cosθ=0时两平面相互垂直
                通过平面方程表示:
                    A1 * A2 + B1 * B2 + C1 * C2 + D = 0
            
            ->#二面角:
                是两个相交平面形成的夹角,一共有四个角,他们两两相等.
                像字母X,把他想象为两个相交平面的正视图.其中所围成的左右两角相同,上下两角相同
        
        ->#两个平面间的距离问题:
            首先对于两个平面求距离问题,两个平面需要平行,因此两个平面的法线方向需要相同.
            例如:
                平面Ax+By+Cz+D1=0 和 平面Ax+By+Cz+D2=0
                他们的距离其实就是D1-D2
            (这里是猜测,没有具体验证)

        ->#间平面:
            平面1和平面2相加获得的新平面,是两个平面的间平面:
                如果平面1平行于平面2,则平面3平行于平面1和平面2 ,并且到两个平面的距离相等
                如果平面1于平面2为交叉关系,则平面3是两个平面的角平分面.

        ->#轴和面的关系:
            Z轴:
                平行
                    1.比如平行于z轴(0,0,1):
                        已知一个z轴的方向向量为(0,0,1),通过面的法向量平面方程可以得到垂直于z轴的平面:
                            |0|   |A|
                            |0| x |B| = (-B,A,0);
                            |1|   |C|
                        这个向量垂直于z轴和平面的法向量,因此由这个向量和z轴(0,0,1)可以组成一个新平面
                            -Bx + Ay + D = 0
                            根据面重合和平行当所有系数和常量成比例,则重合,当系数成比例但常数项不成比例则平行.
                        !!这个平面和原来法向量对应的平面不是一个平面,两个平面甚至是互相垂直的!!
                    
                    2.因为一个(A,B,0)的向量在Oxy平面上,而Oxy垂直于z轴,因此,如果(A,B,0)作为一个平面的法向量,所组成的平面其实就是平行于z轴的:
                        Ax + By + D = 0

                    3.现在有一个随机向量,获得它平行于z轴的平面:
                        v(x0,y0,z0);
                        首先求v到z轴的正投影值:(x,y,z) · (0,0,1) = z0
                        得到新向量l(0,0,z0)
                        通过向量加减得到一个垂直于l(0,0,z0)的向量n,
                            l + n = v
                                n = v - l
                        通过这个n(A,B,0)作为一个平面的法向量,这个平面是基于点(x,y,z)而来的
                            Ax + By + D = 0
                垂直:
                    对于平面方程Cz+D = 0:表示垂直于z轴的平面.
    ->#平面交线:
        有两平面:
            |2x-y+z-3=0
            |x+2y-z+1=0
        求两平面的交线,首先要确定两个面相交,而不是平行,所以求两个平面法线叉乘是否为(0,0,0)
            设:PlaneA_N(2,-1,1), PlaneB_N(1,2,-1)
            得:PlaneA_N x PlaneB_N = AB_N(-1,3,5),所以相交

            设当z等于0时,两个平面联立可以获得两个平面在Oxy平面的交点:
                |2x-y-3=0,①
                |x+2y+1=0
                则2x-y-3 = x+2y+1
                x=3y+4,②
                带入①式:
                    2(3y+4)-y-3=0
                    6y+8-y-3=0
                    5y=-5
                    y=-1
                带入②式:
                    x=1
                则得出两个平面在Oxy上的交点M0(1,-1,0)
                
                最后求直线公式得:
                    l = M0 + tAB_N;
                    随着t的变化可以得到l的坐标;
            
    ->#例题:
        三平面是否相交:
            求2x+3y-z+1=0, x-2y+5z-3=0, 2x+y+z+5=0.三个平面是否相交,以及相交点:
                解:
                    对于平面普通方程,它本身的平面是张量空间下的(x,y,z的关系只要满足最终等于0即可),因此,没有界限.
                    所以对于这种平面相交则需要求他们的法向量是否平行,
                        记2x+3y-z+1=0为A式 , x-2y+5z-3=0为B式 , 2x+y+z+5=0为C式
                        n_A(2,3,-1) , n_B(1,-2,5) , n_C(2,1,1)
                            ∵如果两向量平行则共线,则叉乘的向量为(0,0,0)
                            ∴因此求n_A x n_B 得 n_AB(4,-4,-4)
                            ∵如果n_C · n_AB为0则代表两向量垂直,因此代表他要么跟n_A平行或共线,要么跟n_B平行或共线
                            ∴求n_C · n_AB = -10
                            ∴三平面相交,有交点
                    求点:
                        联立三个方程
                        |2x + 3y - z  + 1=0
                        |x  - 2y + 5z - 3=0
                        |2x + y  + z  + 5=0
                        求得(-35/4 , 29/4 , 21/4);



    ->#曲面:
        ->#球面方程:

        ->#标准球面方程:
            x^2 + y^2 + z^2 = R

        ->#向量球面方程:
            (x-x0)^2 + (y-y0)^2 + (z-z0)^2 = R^2
            化简:
                (x^2 + y^2 + z^2) + (x0^2 + y0^2 + z0^2) - C = 0 | C = [2(xx0 + yy0 + zz0) + R^2]

        ->#点M在球面上的直角坐标方程
            求球上一点M(x,y,z):
                |x = Rcosθcosφ
                |y = Rcosθsinφ
                |z = Rsinθ
                其中:
                    θ是M点做Oxy平面的垂线,OM和ON间的夹角.
                    φ是x轴和ON在Oxy平面上的夹角.
                (θ,φ)是M在球面上的曲纹坐标
                (R,θ,φ)是球面坐标
        ->#曲线和曲面:
            曲线的普通方程是由两个三元方程联立而来,因为曲线的本质是两个曲面的交线.
            曲面的普通方程是三元方程如x^2 + y^2 + z^2 = R^2是一个球面的方程

        ->#曲面参数方程:
            |x = x(u,v),
            |y = y(u,v), | a≤u≤b , c≤v≤d;
            |z = z(u,v),
        ->#曲线参数方程:
            |x = x(t),
            |z = z(t),
            |z = z(t),

        ->#球面方程和平面方程联立获得一个在Oxy平面上的圆的参数方程:
            |x^2 + y^2 + z^2 = R^2,
            |z = 0, --- 0x + 0y + 1z = 0(Oxy的平面方程)

            联立:
                |x = Rcosφ
                |y = Rsinφ
                |z = 0

        ->#旋转面:
            通过母线根据某一轴进行旋转而来的面,为旋转面.
            母线:
                由两个曲面方程得来:
                    |F(x,y,z) = 0
                    |G(x,y,z) = 0
                
                曲面的普通方程的计算方式:
                    |F(x,y,z) = 0
                    |G(x,y,z) = 0
                    |MM1 x v| = |M0M1 x v|              M是母线上一点M0和M1是母线旋转后的平面上一点
                    |A(x-x0) + B(y-y0) + C(z-z0) = 0  
                    
                    详细展开:
                        平面方程:
                            |f(y,z) = 0     (在Oyz平面上的曲面方程)
                            |x = 0          (法线为(1,0,0)的平面即Oyz平面)
                        旋转面方程:
                            |f(y0,z0) = 0               (在Oyz平面上的曲面方程)
                            |x0 = 0                     (法线为(1,0,0)的平面即Oyz平面)
                            |x^2 + y^2 = x0^2 + y0^2 
                            |C(z-z0) = 0                (旋转向量为(0,0,1)的轴,即绕(0,0,1)旋转)
                        最后消参得到曲面公式:
                            f(±sqrt(x^2 + y^2 ,z)) = 0
                        
                        示例:
                            母线:
                                |y^2 = 2pz , p>0
                                |x = 0
                            绕z轴旋转:
                                |y0^2 = 2pz0               (在Oyz平面上的曲面方程)
                                |x0 = 0                     (法线为(1,0,0)的平面即Oyz平面)
                                |x^2 + y^2 = x0^2 + y0^2 
                                |1 * (z-z0) = 0                (旋转向量为(0,0,1)的轴,即绕(0,0,1)旋转)
                            消参:
                                |y0^2 = 2pz0               (在Oyz平面上的曲面方程)
                                |y0  = sqrt(x^2 + y^2)
                                |z0 = z                (旋转向量为(0,0,1)的轴,即绕(0,0,1)旋转)
                                得:
                                    x^2 + y^2 = 2pz
        ->#柱面和锥面:
            由一条直线l沿着一条空间曲线C平行移动所形成的曲面称为柱面.l为母线,C为准线.按定义平面也是柱面.
            这里准线依旧是由两个曲面得来:
                |F(x,y,z) = 0
                |G(x,y,z) = 0
            ->#完整方程为:
                M(x,y,z)是母线上点,M0(x0,y0,z0)是准线上点,且方向向量为v(a,b,c)
                |F(x0,y0,z0)    曲面/平面1
                |G(x0,y0,z0)    曲面/平面2 , 这两个面组成的曲线或线为准线
                |x = f(x0) + λa                                         | x = f(x0)
                |y = g(y0) + λb     ,其中f(x0) g(y0) h(z0)是准线参数方程即| y = g(y0)
                |z = h(z0) + λc                                         | z = h(z0)
            代入化简:
                |F(x-λa , y-λb , z-λc)
                |G(x-λa , y-λb , z-λc);

        ->#圆柱面:
            圆柱面坐标:
                圆柱面上一点的坐标为:M(r,θ,u)
                对应的直角坐标系上的柱面坐标为:
                    |x = rcosθ,
                    |y = rsinθ,
                    |z = u
                表示,面中有一对称轴,所有母线到对称轴的距离都相同,并表示为r:
                r的距离:
                    M(x,y,z)表示母线上points,L0(x1,y1,z1)是对称轴上一点,M0(x0,y0,z0)是准线上points.
                        r = |ML0 x v| / |v|
                        r = (|ML0| * |v| * sinθ) / |v| , sinθ是ML0和v的夹角
                        
                圆柱面点M的坐标:
                    圆柱面上一点的坐标为:M(r,θ,u)
                    对应的直角坐标系上的柱面坐标为:
                        |x = rcosθ,
                        |y = rsinθ,
                        |z = u
                例:
                    有一圆柱的曲线方程:
                        |(x^2/a^2) + (y^2/b^2) - 1 = 0
                        |z = 0
                    通过圆柱参数方程得到准线点M0(x0,y0,z0) , 母线点M(x,y,z) , l轴方向(k,o,h):
                        |(x0^2/a^2) + (y0^2/b^2) - 1 = 0
                        |z0 = 0
                        |x = x0 + ku
                        |y = y0 + ou
                        |z = z0 + hu
                        消参:
                            |[(x-au)^2 / a^2] + [(y-bu)^2 / b^2] = 0
                            |z = hu
        ->#锥面:
            曲线C上的点与不在线上的点M间的连线组成的曲面为锥面,曲线C为锥面的准线,M0为锥面的顶点,曲线C上的各点与M的连线为母线:
                设锥面的顶点M0(x0,y0,z0);
                准线C方程为:
                    |F(x,y,z) = 0
                    |G(x,y,z) = 0
                准线上点M1(x1,y1,z1);
                    带入可以得到每个点的连线:
                        |F(x1,y1,z1)
                        |G(x1,y1,z1)
                锥面方程:
                    求在锥面上的点M:
                        |F(x1,y1,z1)
                        |G(x1,y1,z1)
                        |x1 = x0 + (x-x0)u,
                        |y1 = y0 + (y-y0)u,
                        |z1 = z0 + (z-z0)u,
                    |F((x0+(x-x0)u) , (y0 + (y-y0)u) ,(z0 + (z-z0)u)) = 0
                    |G((x0+(x-x0)u) , (y0 + (y-y0)u) ,(z0 + (z-z0)u)) = 0
            圆锥面:
                跟圆柱面类似,有一个对称轴l.每一条由准线C和顶点M0所连成的母线,与l的夹角相同为α,并称为圆锥面的半顶角.
                因此设M0(x0,y0,z0)为顶点 , 为l(a,b,c)轴向量 , M(x,y,z)为在圆锥面的点
                求M:
                    <M0M , l^0> = α
                    因此有
                        |cos<M0M , l^0>| = cosα
                        |(M0M · l^0) / (|M0M|*|l^0|) = cosα
                        [(x-x0 * a) + (y-y0 * b) + (z-z0 *c)] / sqrt[(x-x0)^2+(y-y0)^2+(z-z0)^2] = cosα
    ->#二次曲面:
        ->#椭球面:
            公式:
                x^2   y^2   z^2
                --- + --- + --- = R | 当a,b,c不成比例,则会出现被压扁的椭球体,反之与球体方程近似.
                a^2   b^2   c^2

            对称性:
                即:y和-y都对于Oxz平面对称,两值相同;x和-x对于Oyz平面对称;z和-z对于Oxy平面对称.
                因此直角坐标系中,三根轴都是椭球的对称轴.

            曲面形状:
                当z=0时,和平面z=0,可以得到关于Oxy的交线:
                    |[(x^2)/(a^2)] + [(y^2)/(b^2)] = R
                    |z=0;
                当z=h时,表示椭圆在z=h时的截面,或者说,与平面z-h=0的截面:
                    |[(x^2)/(a^2)] + [(y^2)/(b^2)] + [(h^2)/(c^2)] = R
                    |z=h;

        ->#单叶双曲面:
            公式:
                x^2   y^2   z^2
                --- + --- - --- = R
                a^2   b^2   c^2
            对称性:
                三个坐标面都根据Oxy或Oyz或Oxz平面对称;也都跟三根对称轴对称,原点为对称中心.
    
    ->#直纹面:
        表示曲面上的同一方向的直线集合,即有大量的直线,全在S曲面上,并且S上的每个点都在这一族中的某条直线上.
        这样一族直线,称为一族直母线.

        其中二次曲面中,部分二次柱面以及二次锥面等等,都是直纹面.
        此外椭球面因为有界,所以有界二次曲面没有直纹面.



    ->#坐标变换
        ->#平面仿射坐标变换:
            ->#M点从坐标系I到II变化后的坐标:
                对于两个仿射坐标系,坐标系I:[O;d1,d2] 和 坐标系II[O';d1',d2'].
                    I的坐标系为直角坐标系:
                        [O(0,0); d1(1,0) , d2(0,1)]
                    II的仿射坐标系为:
                        [O'(O_x+µ , O_y+λ); d1'(x1',y1') , d2'(x2',y2')]
                    现在有一点M他的I坐标为(1,2),而II坐标系的原点O'(2,3),II坐标系的轴方向为d1'(0.9363,0.3511)和d2'(-0.1916,0.3511).
                    求M在II坐标系下,I坐标系的坐标M':
                        !!!因此是仿射坐标系,所以d1,d2作为轴,默认是单位向量!!!
                        M' = (M_x*x1' , M_x*y1') + (M_y*x2' , M_y*y2') + O'
                            (M_x*x1' , M_x*y1'):为将M'的x坐标映射到d1'的方向上位置
                            (M_y*x2' , M_y*y2'):为将M'的y坐标映射到d2'的方向上位置
                            O':是平移M'点到以O'为起点.
                            最后得到的值依旧是I坐标系下的坐标.
                            用矩阵表示:
                                |x1 x2| * |M_x| = |M_x*x1 + M_y*x2|
                                |y1 y2|   |M_y|   |M_x*y1 + M_y*y2|
                        代入得:
                            M' = (1*0.9363 , 1*0.3511) + (2*-0.1916 , 2*0.3511) + (2,3)
                            ≈ (2.544,5.3122)
                            这是I坐标系的坐标,
                            而(1*0.9363 , 1*0.3511) + (2*-0.1916 , 2*0.3511)是II坐标系下的坐标

            ->#M'点从坐标系II变化回I的坐标:
                如果过度矩阵为正交矩阵:
                    |x1 x2| =  |x1 y1|
                    |y1 y2|    |x1 y2|
                则
                    M = |x1 y1| * |M_x-x0|
                        |x1 y2|   |M_y-y0|
                        这里的坐标依旧是I坐标系下的相对坐标:
                            其中M_x和M_y是M'在II的坐标,x0和y0是II坐标系的原点坐标

            ->#克莱姆法则:
                通过行列式求解n元一次方程组的解:
                    对于二元一次方程组的解:
                        |a11x' + a12y' = b1
                        |a21x' + a22y' = b2
                    首先求系数行列式:
                        D=|a11 a12|
                        |a21 a22|
                    求分子行列式:
                        求x'时
                            D1=|b1 a12|
                            |b2 a22|
                        求y'时:
                            D2=|a11 b1|
                            |a21 b2|
                    最后求x'和y':
                        x' = D1/D
                        y' = D2/D

        ->#坐标系变换过渡矩阵:
            坐标系I:[O;e1,e2] 和 坐标系II[O';e1',e2']
                其中:
                    坐标系II旋转θ度,变为坐标系I
                    e1'|a11| & e2'|a12|
                       |a21|      |a22|

                    前提介绍:λ是|(90-θ)|:
                        a11 = cosθ*|e1'| = e1'·e1 = cos<e1',e1>
                        a21 = sinλ*|e1'| = e1'·e2 = cos<e1',e2>

                        a22 = sin
                        a23 = cosθ*|e2'| = e2'·e2



    ->#矩阵运算复习:
        示例矩阵:
            A = |a11 , a12 , a13 ...|    B = |b11 , b12 , b13 , ...|
                |a21 , a22 , a23 ...|        |b21 , b22 , b23 , ...|
                |a31 , a32 , a33 ...|        |b31 , b32 , b33 , ...|
                |... , ... , ... ...|        |... , ... , ... , ...|

        矩阵的加法:
            A+B,A和B中的各个元素对应相加
        
        矩阵的乘法:
            表示A矩阵的横的每个值,依次对应地乘以B矩阵的列地每个值,并相加:
            |a11*b11 + a12*b21 + a13*b31  ,  a11*b12 + a12*b22 + a13*b32  ,  a11*b13 + a12*b23 + a13*b33|
            |a21*b11 + a22*b21 + a23*b31  ,  a21*b12 + a22*b22 + a23*b32  ,  a21*b13 + a22*b23 + a23*b33|
            |a31*b11 + a32*b21 + a33*b31  ,  a31*b12 + a32*b22 + a33*b32  ,  a31*b13 + a32*b23 + a33*b33|
        
        过渡矩阵:
            一个矩阵,可以使得I坐标系,变换到II坐标系.
                |x1 x2| * |M_x| = |M_x*x1 + M_y*x2|
                |y1 y2|   |M_y|   |M_x*y1 + M_y*y2|


        单位矩阵I:
            | 1  ,  0  ,  0  , ...|
            | 0  ,  1  ,  0  , ...|
            | 0  ,  0  ,  1  , ...|
            |... , ... , ... , ...|
            对于任意一个矩阵A与单位矩阵I相乘都会得到原来的矩阵A.
        
        转置矩阵:
                |a11|
            A = |a12| = A^T |a11 , a12 , a13|
                |a13|

        正交矩阵:
            一个矩阵乘以它的转置矩阵得到单位矩阵,则该矩阵为正交矩阵:
                A*A^T=I
                比如:
                    | cosθ  sinθ| * | cosθ  -sinθ|
                    |-sinθ  cosθ|   | sinθ   cosθ|

                    |       1/2  sqrt(3)/2  0| * |      1/2  -sqrt(3)/2 0|
                    |-sqrt(3)/2        1/2  0|   |sqrt(3)/2         1/2 0|  
                    |         0          0  0|   |        0           0 0| 

            正交矩阵充分必要条件:
                正交矩阵每行元素平方和为1
                每两行对应的元素乘积之和等于0
                
                Σ(n,k=1) (a_1k)^2 = 1;
                    即:a11+a12+a13+a1n=1; 
        
        矩阵的逆:
            如果M是正交矩阵,则A*M的逆矩阵为A*M^T




    ->#二次曲线方程判定:
        二次曲线的一般方程为:
            (a11*x^2) + 2(a12*x*y) + (a22*y^2) + 2(a1*x) + 2(a2*y) + a0 = 0
            转化为矩阵形式:
                         |a11 a12 a1| x |x|
                (x,y) * (|a12 a22 a2|   |y|)
                         |a1  a2  a0|   |1|


    ->#两点距离方程:
                            |bx - ax|   |bx - ax|
        distance(a,b) = sqrt(|by - ay| · |by - ay|)
                            |bz - az|   |bz - az|
                



