nag(唠叨)
continuum(连续的)

->#极坐标(Polar Coordinate System):
    极坐标作为笛卡尔坐标的同类坐标系,坐标系由极心(Origin/Pole)和极轴(Pole Axis)以及坐标组成
    2D极轴坐标系:
        极轴在数学中一般指向右,坐标相对于笛卡尔坐标系,表示为radius(极径/半径)和angle(θ或度)表示,记作(θ,r)
        极轴根据角度逆时针旋转为正旋转.
        缺陷:
            在2D极坐标系中有一定的缺陷,
                1.对于一个极坐标系,它其实是由两个半圆组成,因此θ的定义域为[180,-180].
                2.极径是有负极径和正极径的区别的
                3.歧义Alising:
                    如果使用[0,360]表示则会产生同一坐标的两种表示:
                        [5,100°] 和 [-5,280°]
                        或者
                        [5,100] 和 [5,460]
                4.
                    [0.0001°,179.999°]为逆时针旋转,在第一二象限
                    [-0.0001°,-179.999°]为顺时针旋转,为二三象限
    3D极坐标系:
        3D极坐标系有两个系统:
            (r,θ,z) --- 柱体极坐标(cylindircal coordinate)
            (r,θ,Φ) --- 球体极坐标(spherical coordinate)

        柱体极坐标(cylindircal coordinate):
            第三个坐标与笛卡尔坐标相似,可以理解为,点与(r,θ)平面的距离.(而笛卡尔坐标系的第三坐标可以理解为,距离Oxy平面的距离)
        
        球体极坐标(spherical coordinate):
            第三个坐标与可以理解为,点以(r,θ)平面的旋转
            转换为笛卡尔坐标系为:
                (x,y,z) = (r*cosθ , r*sinθ , r*sinΦ)


->#三角函数:
    ->#角度弧度转换:
        1弧度: 
            = 180° / Π (度)
            ≈ 57.29578 (度)
        1度:
            = Π / 180° (弧度)
            ≈ 0.017545 (弧度)
        弧度不会随着半径的变大而变大,
        圆心角对应的弦会随着半径的变大而变大.
    ->#圆心角所对的弦:
        在圆中,圆心角所对的弧不论半径大小,都相同,但是圆心角所对的弦的长度,在相同的角度下,半径越大,弦越长.
        此外,40度所对应的弧长是2倍的20度所对应的弧长,
        但是,40度所对应的弦长,并不是2倍20度所对应的弦长.
            圆心角计算弦长公式:
                设圆心角为α , 弦为g , 半径为r 
                    sin(α/2) = g / 2r
                           g = 2r * sin(α/2)

            弧长计算弦长公式:
                设弧为rad , 圆心角为α , 弦为g , 半径为r 
                    由弧长可以通过反三角函数获得圆心角α:
                        α = arcsin(rad)/2
                    带入圆心角计算弧长公式可得
                    sin(arcsin(rad)/2) = g / 2r
                                     g = 2r * sin(arcsin(rad)/2)
        
        定理:一个圆上的一条弦对应得角始终不变:
                圆上有三点A B C,作AB,AC和BC的连线,AB和AC所对的夹角即BC弦所对应的角.随着A在圆上变化,对应的角不会变化.
            
            强关联定理:
                对于上述弦所对的角是弦所对应的圆心角的一半.
            

        颉元仲
    ->#三角比:
        正弦比:sinθ = oppo/hypo;
            正割比:cesθ = hypo/oppo;
            
            正弦定理1:
                三角形的高计算:
                    h = a*sinα = b*cosα;
                      = a*sinβ = a*cosβ;

        余弦比:cosθ = adja/hypo;
            余割比:secθ = hypo/adja;


        正余弦关系式:
            sin^2(θ) + cos^2(θ) = (oppo/hypo)^2 + (adja/hypo)^2;
                                = (oppo^2 + adja^2) / hypo^2;
                                ∵ oppo^2 + adja^2 = hypo^2
                                ∴ = 1;
                变换:
                    sinθ = sqrt(1-cos^2(θ));
                    cosθ = sqrt(1-sin^2(θ));
            
            虽然sin^2(θ) + cos^2(θ) = 1 , 但是sin(θ) + cos(θ) 是可以大于 1的


            sin(θ) = cos(90-θ);
            cos(θ) = sin(90-θ);


        正切比:tanθ = sinθ/cosθ;
            余切比:
                cotθ = tan^-1(θ);
                    = cosθ/sinθ;


        

    ->#求笛卡尔坐标系下坐标对应的角度数:
        反正弦函数求度数:
            θ = arcsin(y / sqrt(x^2 + y^2)) 
        
        反余弦函数求度数:
            |θ| = arccos(x / sqrt(x^2 + y^2))
       
        反正切函数求度数:
            θ = arctan(y / x); 
            其中x≠0



->#转换表:

    1 inch = 2.54 cm

->#Equations:
    Euqation 7
        (7.1) : x = r*cosθ , y = r*sinθ ; θ = arcsin(y / sqrt(x^2 + y^2)); |θ| = arccos(x / sqrt(x^2 + y^2))  因为cos是偶函数,所以arccos得出来的值是绝对值
        (7.2) : 
                                |0,                     x = 0 , y = 0;
                                |90,                    x = 0 , y > 0;
                atan2(y,x) =    |-90,                   x = 0 , y < 0;
                                |arctan(y/x)            x > 0;
                                |arctan(y/x) + 180,     x < 0 , y ≥ 0;  
                                |arctan(y/x) - 180,     x < 0 , y < 0;