"物质":[土,光,气,水,温度,其他生物];
"意识":[欲望,希望,恐惧,失控]
"生命":[灵,生物,机械体,能量体]

把一切都划出界线,一切都有迹可循,从低到高,无法平等.
生存,通过弱肉强食诞生出一群怪物,在自然界中,有的力量巨大,有的速度极快,有的善于伪装,有的无尚聪颖.
在几千年的演化中总是有的一方,独大,强大到可以拿捏住整个自然界,但又在进化中被生存将其平衡.
从第一类可繁殖的生物开始,到现在已经过了一万年,整个历史被分为了几个阶段,
    开初:
        一切的最开始,生命是从大海中诞生的,这个阶段的生物种类极少,还是一群"灵".这个阶段构成生命的主要依赖的是"物质":土,光,气,水,温度和其他生物;驱使生命不断适应的是"意识",以欲望,希望,恐惧和失控.
        这个时代有三大领域:天空,海洋和大陆.
        天空:是一群没有意识的聚灵体在天空中与气为生,吸收光带来的温度和光蒸发的气体.他们在空中飘荡,不断聚集,消散,再聚集,再消散,驱动整个世界的循环,并将多余的水通过循环带到全世界.它们太依赖物质,没有斗争,没有意识,极少的欲望,恐惧和希望,它们极容易受到物质的影响最后失控.
        海洋:是一群浮游灵体,借助着水移动,靠水获得气和温度,这个时候的他们还有没多少意识,但是是三大种族中意识最强的,他们不断
        大陆:是一群不可行动的无机灵,他们是一群沉睡灵,在土壤中沉睡,有着少量的意识,他们是在梦中的灵,成长是被动的,进化是被动的,适应也是被动的,一切都是被动的.
    适应:
        这个阶段一切都开始混沌,因为气灵的失控导致许多,将是全世界循环使得土灵不可抗的被移动,甚至进入了水灵的区域,水灵也同样被带入土灵的领域.
在这不断演化的时间中,整个自然界大致被分为了九个种族:
    慧族:
        本身是一群弱小的生物,他们的感知力差,四肢弱小,在自然界中总是被捕杀,成为其他种族的食物或者奴隶,但是他们又极其聪明,且不挑食,在夹缝中不断适应.
    飞升族:
        